print("Здравей! Това е моят първи Python калкулатор.")

a = float(input("Въведи първото число: "))
операция = input("Операция (+, -, *, /): ")
b = float(input("Въведи второто число: "))

if операция == "+":
    резултат = a + b
elif операция == "-":
    резултат = a - b
elif операция == "*":
    резултат = a * b
elif операция == "/":
    if b == 0:
        резултат = "Не може да се дели на нула."
    else:
        резултат = a / b
else:
    резултат = "Непозната операция."

print("Резултат:", резултат)